import 'package:flutter/material.dart';

List<List> mundarija = [
  ["ПРЕДИСЛОВИЕ", 3],
  ["ВВЕДЕНИЕ ", 5],
  [" ГЛАВА I. ОБЩИЕ СВЕДЕНИЯ O ТЕКСТИЛЬНЫХ", 6],
  ["Основные свойства волокнообразующих полимеров", 9],
  ["Строение и свойства гидрофобных текстильных волокон", 17],
  ["Физические свойства текстильных волокон", 21],
  [
    " ГЛАВА II. ТЕОРЕТИЧЕСКИЕ ОСНОВЫ ПРОЦЕССОВПОДГОТОВКИ ТЕКСТИЛЬНЫХ МАТЕРИАЛОВ ККРАШЕНИЮ И ПЕЧАТАНИЮ",
    26
  ],
  ["Влияние отделочной среды на структуру текстильных волокон", 26],
  ["Действие температуры на текстильные волокна", 31],
  ["Состав природных волокон и свойства сопутствующих веществ", 34],
  ["Основные свойства волокнообразующих полимеров", 40],
  ["Механизмы и процессы удаления примесей и сопутствующихвеществ", 44],
  [
    "Физико-химические превращения структуры целлюлозных волокон в процессе подготовки хлопчатобумажных материалов",
    50
  ],
  [
    "Современные технологии подготовки текстильных материалов из целлюлозных волокон и их смесей",
    63
  ],
  [
    "Физико-химические основы процессов подготовки текстильных материалов из белковых и химических волокон",
    75
  ],
  ["Общие представления о процессе крашения", 88],
  ["Свойства красителей и их роль в процессе крашения", 92],
  ["Кинетика процесса крашения и диффузия красителей в растворе", 98],
  [
    "Диффузия красителя в волокнистый субстрат (внутренняядиффузия). Расчет значений коэффициента диффузии",
    101
  ],
  ["Термодинамика процесса крашения", 111],
  [
    "Теоретические основы крашения волокнистых материалов прямыми красителями",
    126
  ],
  [
    "Теоретические основы крашения волокнистых материалов активными красителями",
    130
  ],
  [
    "Теоретические основы крашения целлюлозных волокнистых материалов кубовыми красителями",
    136
  ],
  [
    "Теоретические основы крашения дисперсными, катионными и кислотными красителями",
    142
  ],
  ["Основы процессов интенсификации крашения волокнистых материалов", 148],
  [
    "Характеристика химической технологии изготовлениянациональных абровых тканей «Хан-атлас» и возможности их прочного окрашивания",
    170
  ],
  [" ГЛАВАIV.ОСНОВЫ ПРОЦЕССОВПЕЧАТАНИЯ ТЕКСТИЛЬНЫХ МАТЕРИАЛОВ", 176],
  ["Общие представления о процессе текстильной печати", 176],
  ["Структурно-механические и реологические свойства печатных красок", 178],
  ["Печатно-технические показатели красок и методы их определения.", 180],
  ["Состояние и перспективы развития технологий текстильной печати", 187],
  [
    " ГЛАВА V. ТЕОРЕТИЧЕСКИЕ И ТЕХНОЛОГИЧЕСКИЕ ОСНОВЫ ПРОЦЕССОВ ЗАКЛЮЧИТЕЛЬНОЙ ОТДЕЛКИ ТЕКСТИЛЬНЫХ МАТЕРИАЛОВ",
    201
  ],
  ["Заключительная отделка тканей из целлюлозных волокон", 201],
  [
    "Теория и практика придания специальных свойств текстильным волокнистым материалам",
    218
  ],
  ["Придание волокнистым материалам водоотталкивающих свойств", 220],
  [
    "Сущность и технология противозагрязняемой отделки волокнистых материалов",
    226
  ],
  ["Огнезащитная отделка текстильных материалов", 230],
  ["Основы биоцидной и противогнилостной отделки текстильных материалов", 235],
  ["Гидрофилизация гидрофобных волокнистых материалов", 239],
  [
    "Гидрофилизация гидрофобных волокнистых материалов…………… Теория и технология антистатической отделки волокнистых материалов",
    245
  ],
  ["Заключительная отделка шерстяных материалов", 247],
  ["Заключительная отделка материалов из натурального шелка..", 255],
  ["Заключительная отделка смесовых текстильных материалов.", 249],
  [" ГЛАВА VI. НАНОСИСТЕМЫ И НАНОТЕХНОЛОГИИ В ИНДУСТРИИ ТЕКСТИЛЯ", 262],
  ["Общие понятия о наносистемах и нанотехнологиях", 262],
  [
    "Анализ современного состояния и перспектив применениянанотехнологий для модификации и повышении качества текстильных материалов и изделий",
    274
  ],
  ["ИСПОЛЬЗОВАННАЯ ЛИТЕРАТУРА", 294],
  ["СОДЕРЖАНИЕ", 307],
];

List<List> ranglarim = [
  ['0xFFFFBF00', "Желтый"],
  ['0xFF0000FF', "Синий"],
  ['0xFF228c22', "Зеленый"],
  ['0xFFA020F0', "Фиолетвый"],
  ['0xFF808080', "Серый"],
  ['0xFF000000', "Черный"],
  ['0xFFFFC0CB', "Розовый"]
];
